export const privacy = `제1조 개인정보의 처리 목적 (‘koreatech.in’이하 ‘코인’) 은(는) 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
- 고객 가입의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별.인증, 회원자격 유지.관리, 물품 또는 서비스 공급에 따른 금액 결제, 물품 또는 서비스의 공급.배송 등

제 2조 개인정보의 처리 및 보유 기간
① (‘koreatech.in’이하 ‘코인’) 은(는) 정보주체로부터 개인정보를 수집할 때 동의 받은 개인정보 보유․이용기간 또는 법령에 따른 개인정보 보유․이용기간 내에서 개인정보를 처리․보유합니다.

② 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.
☞ 아래 예시를 참고하여 개인정보 처리업무와 개인정보 처리업무에 대한 보유기간 및 관련 법령, 근거 등을 기재합니다.
(예시)- 고객 가입 및 관리 : 서비스 이용계약 또는 회원가입 해지시까지, 다만 채권․채무관계 잔존시에는 해당 채권․채무관계 정산시까지
- 전자상거래에서의 계약․청약철회, 대금결제, 재화 등 공급기록 : 5년

제 3조 개인정보의 제3자 제공
(‘koreatech.in’이하 ‘코인) 은(는) 정보주체의 별도 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우 외에는 개인정보를 제3자에게 제공하지 않습니다.

제 4조 처리하는 개인정보의 항목 작성
① ('koreatech.in'이하 '코인')은(는) 다음의 개인정보 항목을 처리하고 있습니다.
1<일반 회원가입>
- 필수항목 : 이메일, 로그인ID, 이름, 닉네임, 학번, 학부, 학년
- 선택항목 : 휴대전화번호, 성별, 소속 동아리, 소속 자치지구, 졸업여부

2<자동 수집 항목>
- 필수항목 : 서비스 이용 기록, 접속 로그, 접속 IP 정보

제 5조 개인정보의 파기('코인')은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.
-파기절차이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.-파기기한이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 서비스의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

제 6조 개인정보의 안전성 확보 조치 ('코인')은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.
1. 내부관리계획의 수립 및 시행
개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.

2. 개인정보의 암호화
이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

3. 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.

제 7조 개인정보 보호책임자 작성
① BCSD Lab(‘koreatech.in’이하 ‘코인) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보 보호책임자
성명 : 최원빈 (BCSD Lab Project Leader)
연락처 : chldnjsqls1264@gmail.com
※ 개인정보 보호 담당부서로 연결됩니다.

② 정보주체께서는 BCSD Lab(‘koreatech.in’이하 ‘코인) 의 서비스를 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. BCSD Lab(‘koreatech.in’이하 ‘코인) 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.


제 8조 개인정보 처리방침 변경
①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.`;

export const koin = `코인 이용약관
서비스 이용 약관에 동의합니다.

제1조 (목적)
본 약관은 코인이 제공하는 코인 및 코인 관련 제반 서비스(이하 "서비스"라 합니다)의 이용과 관련하여 코인과 코인과의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

제2조 (회원의 정의)
① 회원이란 코인이 제공하는 서비스에 접속하여 본 약관에 따라 코인의 이용절차에 동의하고 코인가 제공하는 서비스를 이용하는 이용자를 말합니다.

제3조 (회원 가입)
① 회원이 되고자 하는 자는 코인이 정한 가입 양식에 따라 회원정보를 기입하고 "동의", "확인" 등의 버튼을 누르는 방법으로 회원 가입을 신청합니다.
② 코인은 제1항과 같이 회원으로 가입할 것을 신청한 자가 다음 각 호에 해당하지 않는 한 신청한 자를 회원으로 등록합니다.
1. 등록 내용에 허위, 기재누락, 오기가 있는 경우
2. 제6조 제2항에 해당하는 회원 자격 제한 및 정지, 상실을 한 경험이 있었던 경우
3. 기타 회원으로 등록하는 것이 코인의의 서비스 운영 및 기술상 현저히 지장이 있다고 판단되는 경우
③ 회원가입계약의 성립시기는 코인의 승낙이 가입신청자에게 도달한 시점으로 합니다.
④ 회원은 제1항의 회원정보 기재 내용에 변경이 발생한 경우, 즉시 변경사항을 정정하여 기재하여야 합니다.

제4조 (서비스의 제공 및 변경)
① 코인은 회원에게 아래와 같은 서비스를 제공합니다.
1. 커뮤니티 서비스
2. 개인화 서비스
3. 검색 서비스
4. 기타 코인이 자체 개발하거나 다른 회사와의 협력계약 등을 통해 회원들에게 제공할 일체의 서비스
② 코인 서비스의 내용 및 제공일자를 제7조 제2항에서 정한 방법으로 회원에게 통지하고, 제1항에 정한 서비스를 변경하여 제공할 수 있습니다.

제5조 (서비스의 중단)
① 코인은 컴퓨터 등 정보통신설비의 보수점검•교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체, 기타 코인이 적절하다고 판단하는 사유에 기하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.
② 제1항에 의한 서비스 중단의 경우에 코인은 제7조 제2항에서 정한 방법으로 회원에게 통지합니다. 다만, 코인이 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.

제6조 (회원 탈퇴 및 자격 상실 등)
① 회원은 코인에 언제든지 자신의 회원 등록 말소(회원 탈퇴)를 요청할 수 있으며 코인는 위 요청을 받은 즉시 해당 회원의 회원 등록 말소를 위한 절차를 밟습니다.
② 회원 탈퇴가 이루어진 경우 회원의 게시물 중 개인 영역(갤로그 서비스 중 마이로그, 방명록 메뉴 등)에 등록된 게시물 일체는 삭제됩니다. 다만, 커뮤니티 서비스, 기타 공용 게시판 등에 등록된 게시물은 삭제되지 않습니다.
③ 회원이 다음 각 호의 사유에 해당하는 경우, 코인은 회원의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.
1. 가입 신청 시에 허위 내용을 등록한 경우
2. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
3. 서비스를 이용하여 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
④ 코인이 회원의 회원자격을 상실시키기로 결정한 경우에는 회원등록을 말소합니다.
⑤ 이용자가 본 약관에 의해서 회원 가입 후 서비스를 이용하는 도중, 연속하여 1년 동안 서비스를 이용하기 위해 로그인 기록이 없는 경우, 코인은 회원의 회원자격을 상실시킬 수 있습니다.

제7조 (회원에 대한 통지)
① 코인이 특정 회원에게 서비스에 관한 통지를 하는 경우 회원정보에 등록된 메일주소를 사용할 수 있습니다.
② 코인이 불특정다수 회원에 대한 통지를 하는 경우 7일 이상 공지사항 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.

제8조 (회원의 개인정보)
코인은 서비스를 제공하기 위하여 관련 법령의 규정에 따라 회원으로부터 필요한 개인정보를 수집합니다. (개인정보에 대한 개별 항목은 개인정보처리방침에서 고지)

제9조 (코인의 의무)
① 코인은 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해서 노력합니다.
② 코인은 회원이 안전하고 편리하게 서비스를 이용할 수 있도록 시스템을 구축합니다.
③ 코인은 회원이 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.
④ 코인은 회원이 서비스를 이용함에 있어 회원에게 법률적인 증명이 가능한 고의 또는 중대한 과실을 입힐 경우 이로인한 손해를 배상할 책임이 있습니다.

제10조 (회원의 ID 및 비밀번호에 대한 의무)
① 코인은 관계법령, "개인정보보호정책"에 의해서 그 책임을 지는 경우를 제외하고, 자신의 ID와 비밀번호에 관한 관리책임은 각 회원에게 있습니다.
② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
③ 회원은 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 코인에 통보하고 코인의 안내가 있는 경우에는 그에 따라야 합니다.

제11조 (회원의 의무)
① 회원은 다음 각 호의 행위를 하여서는 안됩니다.
1. 회원가입신청 또는 변경시 허위내용을 등록하는 행위
2. 코인 및 제3자의 지적재산권을 침해하거나 코인의 권리와 업무 또는 제3자의 권리와 활동을 방해하는 행위
3. 다른 회원의 ID를 도용하는 행위
4. 관련 법령에 의하여 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)의 게시 또는 전송하는 행위
5. 코인의 직원 또는 서비스의 관리자를 가장하거나 타인의 명의를 도용하여 정보를 게시, 전송하는 행위
6. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전송하는 행위
7. 스토킹(stalking) 등 다른 회원을 괴롭히는 행위
8. 다른 회원에 대한 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
9. 불특정 다수의 자를 대상으로 하여 광고 또는 선전을 게시하거나 음란물을 게시하는 행위
10. 코인이 제공하는 갤로그 및 관련 서비스에 게시된 공지사항 규정을 위반하는 행위
② 제1항에 해당하는 행위를 한 회원이 있을 경우 코인은 본 약관 제6조 제2, 3항에서 정한 바에 따라 회원의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.
③ 회원은 그 귀책사유로 인하여 코인이나 다른 회원이 입은 손해를 배상할 책임이 있습니다.

제12조 (공개게시물의 삭제 또는 이용제한)
① 회원의 공개게시물의 내용이 다음 각 호에 해당하는 경우 코인은 해당 공개게시물에 대한 접근을 임시적으로 차단하는 조치를 취할 수 있고, 7일 이내에 각 호의 동일 사례가 2회 이상 반복되는 경우 해당 게시물을 삭제 또는 해당 회원의 회원 자격을 제한, 정지 또는 상실시킬 수 있습니다.
1. 다른 회원 또는 제3자를 비방하거나 중상 모략으로 명예를 손상시키는 내용
2. 음란물, 욕설 등 공서양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 내용
3. 범죄행위와 관련이 있다고 판단되는 내용
4. 다른 회원 또는 제3자의 저작권 등 기타 권리를 침해하는 내용
5. 종교적, 정치적 분쟁을 야기하는 내용으로서, 이러한 분쟁으로 인하여 코인의 업무가 방해되거나 방해되리라고 판단되는 경우
6. 타인의 개인정보, 사생활을 침해하거나 명예를 손상시키는 경우
7. 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우
8. 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
② 회원의 공개게시물로 인한 법률상 이익 침해를 근거로, 다른 회원 또는 제3자가 회원 또는 코인을 대상으로 하여 민형사상의 법적 조치(예:고소, 가처분신청, 손해배상청구소송)를 취하는 동시에 법적 조치와 관련된 게시물의 삭제를 요청해오는 경우, 코인은 동 법적 조치의 결과(예: 검찰의 기소, 법원의 가처분결정, 손해배상판결)가 있을 때까지 관련 게시물에 대한 접근을 잠정적으로 제한할 수 있습니다.

제13조 (저작권의 귀속 및 게시물의 이용)
① 코인이 작성한 저작물에 대한 저작권, 기타 지적재산권은 코인에 귀속합니다.
② 회원은 코인이 제공하는 서비스를 이용함으로써 얻은 정보를 코인의 사전승낙 없이 복제, 전송, 출판, 배포, 방송, 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
③ 회원이 서비스 내에 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 단, 코인는 서비스의 운영, 전시, 전송, 배포, 홍보의 목적으로 회원의 별도의 허락 없이 무상으로 저작권법에 규정하는 공정한 관행에 합치되게 합리적인 범위 내에서 다음과 같이 회원이 등록한 게시물을 사용할 수 있습니다.
1. 서비스 내에서 회원 게시물의 복제, 수정, 개조, 전시, 전송, 배포 및 저작물성을 해치지 않는 범위 내에서의 편집 저작물 작성
2. 미디어, 통신사 등 서비스 제휴 파트너에게 회원의 게시물 내용을 제공, 전시 혹은 홍보하게 하는 것. 단, 이 경우 코인은 별도의 동의 없이 회원의 이용자ID 외에 회원의 개인정보를 제공하지 않습니다.
3. 코인은 전항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우, 전화, 팩스, 전자우편 등의 방법을 통해 사전에 회원의 동의를 얻어야 합니다.

제14조 (광고게재 및 광고주와의 거래)
① 코인이 회원에게 서비스를 제공할 수 있는 서비스 투자기반의 일부는 광고게재를 통한 수익으로부터 나옵니다. 회원은 회원이 등록한 게시물의 내용을 활용한 광고게재 및 기타 서비스상에 노출되는 광고게재에 대해 동의합니다.
② 코인은 서비스상에 게재되어 있거나 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 손실과 손해에 대해 책임을 지지 않습니다

제15조 (약관의 개정)
① 코인은 약관의규제등에관한법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진등에관한법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
② 다만, 개정 내용이 회원에게 불리할 경우에는 적용일자 30일 이전부터 적용일자 전일까지 공지합니다.
③ 회원은 변경된 약관에 대해 거부할 권리가 있습니다. 회원은 변경된 약관이 공지된 후 15일 이내에 거부의사를 표명할 수 있습니다. 회원이 거부하는 경우 코인은 당해 회원과의 계약을 해지할 수 있습니다. 만약 회원이 변경된 약관이 공지된 후 15일 이내에 거부의사를 표시하지 않는 경우에는 동의하는 것으로 간주합니다.

제16조 (재판관할)
코인과 회원간에 발생한 서비스 이용에 관한 분쟁에 대하여는 대한민국 법을 적용하며, 본 분쟁으로 인한 소는 민사소송법상의 관할을 가지는 대한민국의 법원에 제기합니다.`;

export const marketing = `마케팅 수신 동의 약관

제1조 수집 및 이용 목적
코인('koreatech.in'이하 'KOIN') 은(는) 한국기술교육대학교 학생들을 위한 맞춤형 서비스를 제공하기 위해, 이용자의 전화번호 및 추후 수집할 이메일 주소 등의 개인정보를 활용하여 다양한 마케팅 및 광고성 정보를 제공할 수 있습니다. 이용 목적은 아래와 같습니다.
- 뉴스레터 발송, 신규 기능 안내 및 홍보, 맞춤형 서비스 및 기능 추천, 사용자 경험 개선을 위한 신규 기능 개발 및 이벤트 안내 등

제 2조 개인정보 수집 항목
- 현재 수집 항목: 전화번호
- 추후 수집 예정 항목: 이메일 주소 (수집 시 별도 안내 예정)

제 3조 마케팅 정보 전송 방법
- SMS(문자 메시지)
- 이메일(수집 동의 시)
- 푸시 알림(앱 내 알림)

제 4조 보유 및 활용기간
- 마케팅 활용 동의일로부터 회원 탈퇴 또는 동의철회 시까지

* 본 동의 약관은 선택사항이며, 동의하지 않아도 코인('koreatech.in'이하 'KOIN') 어플의 기본 서비스 이용에는 아무런 제한이 없습니다.
* 마케팅 정보 수신 동의/해제는 언제든지 어플의 설정 메뉴에서 변경하실 수 있습니다.`;
